# Clear Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssetSet..::..Clear Method
AssetSet Class See Also
---
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual void Clear()
```

Visual Basic
---
```text
Public Overridable Sub Clear
```

Visual C++
---
```text
public:
virtual void Clear()
```

# See Also
AssetSet Class
Autodesk.Revit.DB.Visual Namespace